Repository: Hossam52/e-learning
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Skip
ar: تخطى

# boarding1
source: Enjoy an outstanding learning experience
ar: تمتع بتجربة تعليم متميزة

# boarding2
source: Test your knowledge and invite your friends to start the competition
ar: اختبار معلوماتك وادع اصدقائك لبدء المنافسة

# boarding3
source: Ask and learn
ar: اسأل واتعلم

# who_you_are
source: Who are you ?
ar: من انت ؟

# sign_in_with_social
source: Sign in with an social media account
ar: تسجيل الدخول من خلال حساب التواصل الاجتماعى

source: Google
ar: جوجل

source: Facebook
ar: فيس بوك

# sign_in_with_email
source: Sign in via email
ar: تسجيل الدخول من خلال الايميل

# new_to_app
source: New to app! Create an account
ar: جديد ! قم بإنشاء حساب

source: Sign in
ar: تسجيل الدخول

# email_validate
source: Please enter your email address
ar: الرجاء إدخال عنوان البريد الإلكتروني الخاص بك

# email_validate2
source: Please check your entered email
ar: تحقق من بريدك الالكتروني

# password_validate
source: Please enter your password
ar: من فضلك ادخل كلمة المرور

# password_validate2
source: Your password is weak, enter more than six characters
ar: كلمة المرور الخاصة بك ضعيفة ، أدخل أكثر من ستة أحرف

source: Forget password ?
ar: نسيت كلمة المرور ؟

source: Create Account
ar: إنشاء حساب

source: Have account!
ar: لديك حساب!

source: sign in here
ar: قم بتسجيل الدخول من هنا

# name_validate
source: Please enter your name
ar: من فضلك ادخل اسمك

# password_confirmation
source: Confirm password
ar: تأكيد كلمة المرور

# password_confirmation_validate
source: Please enter your confirm password
ar: تأكيد كلمة المرور مطلوبة

# password_confirmation_validate2
source: Password confirm not match password
ar: تأكيد كلمة المرور لا يساوي كلمة المرور

source: Country
ar: الدولة

source: Choose country
ar: اختار الدولة

# education_stage
source: Educational stage
ar: المرحلة الدراسية

source: Failed
ar: حدث خطأ

# success_sign
source: Success
ar: تم التسجيل

# choose_at_least_subject
source: Choose one or more subjects
ar: اختر مادة واحدة او اكثر

# general_validate
source: This is a required field
ar: هذا حقل مطلوب

# complete_your_data
source: Complete your information
ar: اكمل بيناتك

source: My points
ar: نقاطي الحالية

# my_profile
source: Profile
ar: ملف شخصي

# list_of_the_best
source: Best members
ar: قائمة الافضل

# who_following
source: Following list
ar: من اتابعهم

source: How to use
ar: شرح الاستخدام

source: Privacy policy
ar: سياسة الخصوصية

source: Contact us
ar: تواصل معنا

source: About app
ar: عن التطبيق

source: Golden Membership
ar: العضوية الذهبية

source: Logout
ar: تسجيل الخروج

source: Home
ar: الرئيسية

source: My groups
ar: مجموعاتي

source: My friends
ar: اصدقائي

source: My schedule
ar: جدولي

# best_teachers
source: Top Teachers
ar: المعلمون الأعلى متابعة

# best_students
source: Top-point students
ar: الطلاب الأعلى نقاطا

source: Categories
ar: الاقسام

# teacher_Guides
source: Teacher's Guides
ar: أدلة المعلم

source: Reviews
ar: مراجعات

source: Notes
ar: مذكرات

source: Ministry books
ar: كتب الوزاره

source: Exams
ar: امتحانات

source: Preparation book
ar: دفتر التحضير

# points_count
source: points
ar: عدد النقاط

# latest_test
source: Latest Tests
ar: الاختبارات التي تم انشاؤها مؤخراً

source: Discover
ar: استكشف

# add_success
source: Added successfully
ar: تم الرفع بنجاح

# st_1
source: First Place
ar: المركز الاول

# st_2
source: Second Place
ar: المركز الثاني

# st_3
source: Third Place
ar: المركز الثالث

# st_4
source: Fourth Place
ar: المركز الرابع

# st_5
source: Fifth Place
ar: المركز الخامس

# st_6
source: Six Place
ar: المركز السادس

# st_7
source: Seven Place
ar: المركز السابع

# st_8
source: Eight Place
ar: المركز الثامن

# st_9
source: Nine Place
ar: المركز التاسع

# st_10
source: Ten Place
ar: المركز العاشر

# what_do_you_want_to_say
source: What's on your mind?
ar: ماذا تريد ان تشارك؟'

# what_do_you_want_to_student
source: What do you want to ask? share?
ar: ماذا تريد ان تسأل؟ تشارك؟

# enter_more_than_50_char
source: Please enter more than 50 characters
ar: من فضلك ادخل اكثر من 50 حرف

source: Post
ar: نشر

source: Questions
ar: اسئله

source: Share
ar: مشاركة

source: Add Images
ar: اضف صور

source: Remove Images
ar: حذف الصور

source: Answered
ar: تمت الاجابه

source: Unanswered
ar: لم يتم الاجابة

source: Delete the post
ar: حذف المنشور

source: Do you really want to delete this post
ar: هل تريد حقا حذف هذا المنشور

# me_too
source: also me
ar: انا ايضا

# you_reached_limit
source: sorry, you have reached limit usage for today
ar: عذرا لقد تجاوزت الحد المسموح به اليوم

source: Add
ar: اضافة

source: Add friend
ar: اضافة صديق

source: After
ar: بعد

source: After navigation
ar: بعد التنقل

source: All
ar: الكل

source: An error has occurred
ar: حدث خطأ

source: ar
ar: ع

source: Are you sure to exit
ar: هل أنت متأكد من الخروج؟

source: Before
ar: قبل

source: Block
ar: حظر

source: Books
ar: الكتب

source: Choose Language
ar: اختر اللغة

source: Comment
ar: تعليق

source: Data
ar: بيانات

source: Date
ar: التاريخ

source: Delete
ar: حذف

source: Description
ar: الوصف

source: Done
ar: تم

source: Download
ar: تحميل

source: Edit
ar: تعديل

source: Edit Post
ar: تعديل المنشور

source: Email
ar: البريد الالكتروني

source: Empty
ar: فارغ

source: Field required
ar: الحقل مطلوب

source: Follow
ar: متابعة

source: Free
ar: مجاني

source: Group
ar: مجموعة

source: Home work
ar: الواجب

source: ID
ar: المعرف الشخصي

source: Enter ID
ar: ادخل المعرف الشخصي

source: Just now
ar: الان

source: Loading
ar: تحميل

source: No
ar: لا

source: Notifications
ar: الاشعارات

source: Password
ar: كلمة المرور

source: Pending
ar: معلق

source: Private
ar: خاص

source: Question
ar: سؤال

source: Records
ar: سجلات

source: Remove
ar: إزالة

source: Remove friend
ar: ازالة الصديق

source: Search
ar: بحث

source: Student
ar: طالب

source: Subject
ar: المادة

source: Tag Al Qemma
ar: تاج القمة

source: Teacher
ar: معلم

source: Test
ar: الاختبار

source: Tests
ar: اختبارات

source: This field is required
ar: هذا الحقل مطلوب

source: Try again
ar: حاول مجددا

source: Unknown
ar: غير مغروف

source: View all
ar: عرض الكل

source: Yes
ar: نعم

source: Your rate
ar: تقييمك

# search_any_thing
source: Search for any thing
ar: ابحث عن اى شيئ

source: Start now
ar: ابدأ الان

source: Answer
ar: اجابه

source: Make test
ar: اختبر

# choose_right_answer
source: Choose the correct answer
ar: اختر الاجابة الصحيحة

source: Choose exam
ar: اختر الامتحان

# choose_lang
source: Choose language
ar: اختر اللغة

source: Choose Challengers
ar: اختر المنافسين

# enter_email_for_new_password
source: Enter your email for recieving mail to create new password
ar: ادخل البريد الالكتروني الخاص بك لكي تصلك رسالة للتأكيد لأنشاء كلمة مرور جديدة

# enter_code_sent_to
source: Enter the code sent to
ar: أدخل الرمز المرسل إلى

# enter_new_password
source: Enter the new password
ar: ادخل كلمة السر الجديدة

source: Ask teacher
ar: اسال المعلم

source: Test questions
ar: اسألة الاختبار

source: Homework questions
ar: اسألة الواجب

source: Exam name
ar: اسم الامتحان

source: File name
ar: آسم الملف

source: Homework name
ar: اسم الواجب

source: Playlist name
ar: اسم قائمه التشغيل

source: Join
ar: اشتراك

# my_firends
source: My friends
ar: أصدقائي

source: Add answer
ar: اضف اجابه

source: Add question
ar: اضف سؤال

source: Add image
ar: اضف صورة

source: Show ID on profile
ar: اظهار الاي دي على بروفايلي

source: Reset password
ar: إعادة تعيين كلمة المرور

source: Like
ar: اعجاب

source: Write comment here
ar: اكتب تعليق هنا

# wrong_answer
source: Wrong answers
ar: الاجابات الخاطئة

# right_answer
source: Correct answers
ar: الاجابات الصحيحة

source: Name
ar: الأسم

source: Settings
ar: الاعدادات

source: Next
ar: التالى

source: Rank
ar: الترتيب

source: Semster
ar: الترم

source: First semster
ar: الترم الاول

source: Second semster
ar: الترم التاني

source: Academic semster
ar: الترم الدراسي

source: Comments
ar: التعليقات

# rate
source: Rating
ar: التقييم

# official_groups_for_my_subjects
source: Offical groups for my subjects
ar: الجروبات الرسمية لموادك

source: Back
ar: الرجوع

source: Code
ar: الرمز

source: Previous
ar: السابق

source: Academic year
ar: السنة الدراسية

source: Year
ar: السنه

source: Class nine
ar: الصف التاسع

source: Classroom
ar: الصف الدراسي

source: Cancel
ar: الغاء

source: Videos
ar: فيديوهات

source: Language
ar: اللغة

source: Followers
ar: متابعًا

source: Groups
ar: المجموعات

# time_taken
source: Time taked
ar: المدة المستغرقة

source: Stage
ar: المرحلة

source: Primary stage
ar: المرحلة الابتدأية

# prep_stage
source: Perparatory stage
ar: المرحلة الاعدادية

source: First place
ar: المركز الاول

# users_high_points
source: Highest user points
ar: المستخدمين الأعلى نقاطا

source: Teachers
ar: المعلمين

source: Suggested teachers
ar: المعلمين المقترحين

source: Personal profile
ar: الملف الشخصى

# personal_profile_teacher
source: Personal teacher profile
ar: الملف الشخصى للمعلم

source: Posts
ar: المنشورات

source: Subjects
ar: المواد

source: Percentage
ar: النسبه المئوية

source: Homeworks
ar: الواجبات

source: Yesterday
ar: أمس

source: Create
ar: انشاء

source: Create group
ar: إنشاء مجموعة

# create_competition
source: Create new competition
ar: انشاء منافسه جديده

# create_homework
source: Create new homework
ar: انشاء واجب

# joing_group
source: Joing to group
ar: انضم الى المجموعة

source: Finish
ar: انهاء

source: Day before yesterday
ar: اول أمس

source: Start
ar: بدأ

# please_check_email
source: Please check your email
ar: برجاء تحقق من بريدك الالكتروني

source: Championships
ar: بطولات

# tournment_now
source: Championship now
ar: بطوله جاريه الان

source: Confirm
ar: تأكيد

source: Confirm email
ar: تأكيد البريد الالكتروني

source: Confirm password
ar: تاكيد كلمة السر

source: Specify exam time
ar: تحديد وقت الاختبار

source: Specify homework time
ar: تحديد وقت الواجب

source: Verify
ar: تحقق

# partecipation_order
source: Participation order
ar: ترتيب المشاركين

source: Classification
ar: تصنيف

source: Change password
ar: تغيير كلمة المرور

# recieve_notification_from_outside
source: Recieve notifications from outside the phone
ar: تلقي اشعارات التطبيق على الهاتف من الخارج

# compititors_notifications
source: Recieve notifications from compititors
ar: تلقي اشعارات المنافسين

# recieve_notification_from_followed_teachers
source: Recieve notifications from followed teachers
ar: تلقي اشعارات من المعلمين الذي اتابعهم

source: Done subscription
ar: تم اشتراك

source: Success adding
ar: تم الاضافة بنجاح

source: Success register
ar: تم التسجيل

source: Copied to clipboard
ar: تم النسخ الكود

source: File downloaded before
ar: تم تحميل الملف من قبل

# blocked_user
source: This member is blocked
ar: تم حذر هذا العضو

source: Enable users write to my profile
ar: تمكين المستخدمين من الكتابة على بروفايلي

# new_word
source: New
ar: جديد

source: Error happened
ar: حدث خطأ

source: Remove group
ar: حذف المجموعة

source: My account
ar: حسابي

source: Save
ar: حفظ

source: Solve homework
ar: حل واجب

source: Exit
ar: خروج

# exit_from_exam
source: Exit test
ar: خروج من الاختبار

# link_error_try_again
source: Link error ensure the link and try again
ar: خطا فى الرابط برجاء التأكد من الرابط و المحاولة مجددا

# my_invitation
source: My invitations
ar: دعواتي

source: Number
ar: رقم

source: Math
ar: رياضيات

source: Friend requests
ar: طلبات الصداقه

source: Public
ar: عامة

# questions_num
source: Questions number
ar: عدد الاسئلة

# points_num
source: Points number
ar: عدد النقاط

source: Error happened try again
ar: عذرا حدث خطا حاول مرة اخرى

# no_data
source: Sorry, there are no data
ar: عذرا لا يوجد بيانات

# no_posts
source: Sorry, there are no posts
ar: عذرا لا يوجد منشورات

# arabic
source: العربية
ar: عربي

source: Show correct answers
ar: عرض الاجابات الصحيحة

source: Premium member
ar: عضو مميز

source: Free membership
ar: عضوية مجانية

source: About teacher
ar: عن المعلم

source: Video title
ar: عنوان الفديو

source: Group title
ar: عنوان المجموعة

source: My videos
ar: فديوهاتي

source: Physics
ar: فيزياء

source: Teachers list
ar: قائمة المعلمين

# password_not_correct
source: Entered password not correct
ar: كلمة التى ادخلتها غير صحيحة

source: New password
ar: كلمة السر الجديدة

# you_could_not_join
source: You couldn't join
ar: لا يمكنك الاشتراك

source: No found
ar: لا يوجد

source: No answers
ar: لا يوجد اجابات

source: No tests
ar: لا يوجد اختبارات

source: No notifications up till now
ar: لا يوجد اشعارات حتى الان

source: No comments up till now
ar: لا يوجد تعليقات حتى الان

source: No videos
ar: لا يوجد فيديوهات

source: No videos up till now
ar: لا يوجد فيديوهات حتى الان

# no_wrong_answers
source: No wrong answewrs
ar: لا يوجد لديك اجابات خاطئة

# no_exams_up_til_now
source: You doens't have exams up till now
ar: لا يوجد لديك امتحانات حتى الان

source: No teachers
ar: لا يوجد معلمين

source: No teachers up till now
ar: لا يوجد معلمين حتى الان

source: No files up till now
ar: لا يوجد ملفات حتى الان

source: Invite to competition
ar: لقد دعاك الي مسابقه

# taken_exam_before
source: You have taken this exam before
ar: لقد قمت بأداء هذا الامتحان من قبل

source: Not solved
ar: لم يحل

source: Private group
ar: مجموعة خاصة

# public_group
source: Official classroom group
ar: الجروب الرسمي لصفك

# remove_comment
source: Delete comment
ar: مسح الكومنت

# remove_post
source: Delete post
ar: مسح المنشور

source: Leave group
ar: مغادره الجروب

# who_i_follow
source: Who I followed
ar: من اتابعهم

source: Please select answer
ar: من فضلك اختر اجابة

# enter_group_name
source: Please enter the group name
ar: من فضلك ادخل اسم المجموعة

# enter_name
source: Please enter the name
ar: من فضلك ادخل الاسم

# enter_email
source: Please enter you email
ar: من فضلك ادخل البريد الالكتروني

# enter_pin_code
source: Please enter you pin code
ar: من فضلك ادخل الرمز

# enter_video_url
source: Please enter your video url
ar: من فضلك ادخل رابط الفيديو

# enter_video_title
source: Please enter video title
ar: من فضلك ادخل عنوان الفيديو

# enter_group_description
source: Please enter group description
ar: من فضلك ادخل وصف المجموعة

# please_complete_your_data
source: Please complete your information
ar: من فضلك اكمل بيناتك

source: Competition
ar: منافسة

source: Compete
ar: نافس

source: Results
ar: نتائج

source: Homework results
ar: نتائج الواجب

source: Copy
ar: نسخ

source: Group type
ar: نوع المجموعة

# sure_delete_notification
source: Are you sure to delete this notification
ar: هل انت متأكد من حذف هذا الاشعار

# sure_delete_comment
source: Are you sure to delete comment
ar: هل تريد حقا مسح هذا الكومنت

# sure_delete_post
source: Are you sure to delete post
ar: هل تريد حقا مسح هذا المنشور

source: Group description
ar: وصف المجموعة

source: Must more than
ar: يجب ان يكون 6 احرف او اكثر

# can_know_results_after_all_finished
source: You can know the results and the correct answers after all users finish or the time is out
ar: يمكنك معرفه النتيجه واجباتك الصحيحة عند انتهاء جميع المستخدمين من المشاركه او انتهاء الوقت

# error_happened_enter_images_again
source: Error happened, enter the images again
ar: يوجد خطا من فضلك ادخل الصور مجددا

source: Please enter correct code
ar: الرجاء إدخال رمز صحيح

source: Code not sent?
ar: لم يصلك الكود؟

# resend_code
source: Resend the code
ar: اعادة ارسال الكود

# enter_code_to_change_password
source: Enter code sent to your email and change your password
ar: أدخل الرمز المرسل إلى بريدك الإلكتروني ، وقم بتغيير كلمة المرور الخاصة بك

source: Highest points
ar: الاعلي نقطا

source: Do you really want to delete this group?
ar: هل تريد حقا حذف هذه المجموعة؟

# all_followers
source: Followers
ar: المتابعين

source: Finished!!
ar: انتهت!!

source: Correct answers
ar: الاجابات الصحيحة

source: Your answer is
ar: اجابتك هي

source: Right answer is
ar: الاجابة الصحيحة هي

# confirm_exit_all_answered_will_be_deleted
source: Confirm exit all answers will be deleted?
ar: هل تريد ان تخرج من الاختبار كل ما اجبته سوف يحذف؟

# confirm_start_test_now
source: Are you sure to start test now?
ar: هل تريد بدأ هذا الاختبار الان؟

source: Create test
ar: انشاء اختبار

source: Edit test
ar: تعديل الاختبار

# sure_to_delete
source: Are you sure to delete
ar: هل انت متأكد من انك تريد حذف

source: Choose image from
ar: اختر صورة من
